Revit 2027 API
SunAndShadowSettings.RelativeToView Property
 Identifies whether the SunAndShadowSettings element is relative to the view direction. This is only relevant for lighting mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RelativeToView { get; set; }
Public Property RelativeToView As Boolean
	Get
	Set
public:
property bool RelativeToView {
	bool get ();
	void set (bool value);
}
member RelativeToView : bool with get, set
Property Value
Boolean
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace